Hey @chrisdoherty4 👋 Thank you for the additional information. Based on that, it does sound like you're running into the data resource behavior described in the document I linked before.

To demonstrate further, I've created a sample configuration that utilizes two modules with a `depends_on` on the second one:

<details><summary>Root configuration</summary>

```hcl
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.95"
    }
  }
}

provider "aws" {
  region = "us-east-1"
}

data "aws_region" "current" {}

module "first" {
  source = "./module"
}

module "second" {
  source     = "./module2"
  depends_on = [module.first]
}

output "region" {
  value = data.aws_region.current.name
}

output "module_region" {
  value = module.second.region
}

```
</details>

<details><summary> "module" Configuration</summary>

```hcl
locals {
  timestamp = formatdate("YYYY-MM-DD-ss", plantimestamp())
}

resource "aws_s3_bucket" "example" {
  bucket_prefix = "jretzolk-example-bucket-"

  tags = {
    "updated-at" = local.timestamp
  }
}
```
</details>

<details><summary>"module2" Configuration</summary>

```hcl
data "aws_region" "current" {}

resource "aws_s3_bucket" "example" {
  bucket_prefix = "jretzolk-example-bucket-${data.aws_region.current.name}"
}

output "region" {
  value = data.aws_region.current.name
}
```
</details>
A few notes about the configuration before getting into the plan output:

- By using the `plantimestamp()` function in the tags on the `aws_s3_bucket` resource in the first module, it will have planned changes on every run.
- The outputs on the root configuration are meant to demonstrate that without dependencies, the `aws_region`  data source is read during plan time. Since the data source within the module has dependencies that have planned changes, its read will be deferred until apply time.
- In the second module, since the `aws_s3_bucket` resource uses a value from the `aws_region` data source in a `ForceNew` argument, and that value is not read until apply time, it will be forced to be recreated, much like your scenario.

<details><summary>First run details</summary>


A couple of things of note from the plan portion of the run:

- The plan calls out that `module.second.data.aws_region.current` will be read during apply (this is Terraform's way of indicating the deferral)
- The `module_region` is marked as `(known after apply)`, demonstrating the deferral as well

```console
$ terraform apply
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.first.aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "jretzolk-example-bucket-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "updated-at" = "2025-04-23-22"
        }
      + tags_all                    = {
          + "updated-at" = "2025-04-23-22"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.second.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.second.aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + module_region = (known after apply)
  + region        = "us-east-1"
```

After confirming the plan:

```console
module.first.aws_s3_bucket.example: Creating...
module.first.aws_s3_bucket.example: Creation complete after 2s [id=jretzolk-example-bucket-20250423182916926300000001]
module.second.data.aws_region.current: Reading...
module.second.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.second.aws_s3_bucket.example: Creating...
module.second.aws_s3_bucket.example: Creation complete after 1s [id=jretzolk-example-bucket-us-east-120250423182918762400000002]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

module_region = "us-east-1"
region = "us-east-1"
```

</details>

<details><summary>Second run details</summary>
A couple of things to note about the plan portion of this run:

- `module.first.aws_s3_bucket.example` will be updated in place; this is important, since it causes the deferral
- Again we see that `module.second.data.aws_region.current` will be read during apply, since it's dependent on a resource with planned changes (via the `depends_on` at the module level)
- Since `module.second.aws_s3_bucket.example` uses an output from the deferred data source in an argument that is `ForceNew`, and that value cannot be known at plan time, the resource is marked for replacement
- The `module_region` output is again marked as `(known after apply)` and appears in the plan as a planned change, again a result of the deferral.

```console
$ terraform apply
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.first.aws_s3_bucket.example: Refreshing state... [id=jretzolk-example-bucket-20250423182916926300000001]
module.second.aws_s3_bucket.example: Refreshing state... [id=jretzolk-example-bucket-us-east-120250423182918762400000002]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.first.aws_s3_bucket.example will be updated in-place
  ~ resource "aws_s3_bucket" "example" {
        id                          = "jretzolk-example-bucket-20250423182916926300000001"
      ~ tags                        = {
          ~ "updated-at" = "2025-04-23-22" -> "2025-04-23-25"
        }
      ~ tags_all                    = {
          ~ "updated-at" = "2025-04-23-22" -> "2025-04-23-25"
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.second.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.second.aws_s3_bucket.example must be replaced
-/+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::jretzolk-example-bucket-us-east-120250423182918762400000002" -> (known after apply)
      ~ bucket                      = "jretzolk-example-bucket-us-east-120250423182918762400000002" -> (known after apply)
      ~ bucket_domain_name          = "jretzolk-example-bucket-us-east-120250423182918762400000002.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "jretzolk-example-bucket-us-east-1" -> (known after apply) # forces replacement
      ~ bucket_regional_domain_name = "jretzolk-example-bucket-us-east-120250423182918762400000002.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "jretzolk-example-bucket-us-east-120250423182918762400000002" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "23719e29ab598da11f73862e3ae93224342d7c6bc806fc908f9a2d17df5a0af1" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ module_region = "us-east-1" -> (known after apply)
```

After confirming the plan:

```console
module.second.aws_s3_bucket.example: Destroying... [id=jretzolk-example-bucket-us-east-120250423182918762400000002]
module.second.aws_s3_bucket.example: Destruction complete after 1s
module.first.aws_s3_bucket.example: Modifying... [id=jretzolk-example-bucket-20250423182916926300000001]
module.first.aws_s3_bucket.example: Modifications complete after 1s [id=jretzolk-example-bucket-20250423182916926300000001]
module.second.data.aws_region.current: Reading...
module.second.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.second.aws_s3_bucket.example: Creating...
module.second.aws_s3_bucket.example: Creation complete after 1s [id=jretzolk-example-bucket-us-east-120250423183945773400000001]

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

Outputs:

module_region = "us-east-1"
region = "us-east-1"
```
</details>

Since this is ultimately behavior that's dictated by the way Terraform itself operates, and isn't something that the AWS Provider team needs to take any additional action on, I'm going to go ahead and close this issue out. If you have additional questions, I would recommend opening a new topic in the [Terraform Discuss forum](https://discuss.hashicorp.com/c/terraform-core/27). If you do experience any additional unexpected behavior, please do let us know!